#set и frozenset-Բազմություններ
# Էլեմենտնորը չեն կրկնվում
a = set()
print(type(a))
print(a)
b = set('lesson')
print(b)

c = {i ** 2 for i  in range(10)}
print(c)
# set-ի պարագայում հնարավոր է հետագայում փոփոխություններ կիրառել բազմության մեջ, իսկ frozenset-ի պարագայում անհնար է

a = {2, 45, 144, 2.25}
x = 2
print( x in a) # ցույց է տալիս x-ի նույնականացուցիչէ առկա է տվյալ բազմությունում թե ոչ
print(len(a))  #ցույց է տալիս էլեմենտների քանակը

f = {1, 4, 45, 's'}
e = {23, 'u', 7}
print(f.isdisjoint(e))